; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_4_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 - counter
	)
  (:init
		(= (value c0) 65)
	(= (value c1) 41)
	(= (value c2) 45)
	(= (value c3) 2)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 1 of 3
2. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 1 of 3
3. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 1 of 3
4. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 1 of 3
5. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 1 of 3
6. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 1 of 3
7. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 1 of 3
8. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 1 of 3
9. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 1 of 3
10. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 1 of 3
11. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 1 of 3
12. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 1 of 3
13. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 1 of 3
14. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 1 of 3
15. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 1 of 3
16. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 1 of 3
17. (increment c3)
   changed: (value c3) from 2 to 8
   goals met: 1 of 3
18. (increment c3)
   changed: (value c3) from 8 to 14
   goals met: 1 of 3
19. (increment c3)
   changed: (value c3) from 14 to 20
   goals met: 1 of 3
20. (increment c3)
   changed: (value c3) from 20 to 26
   goals met: 1 of 3
21. (increment c3)
   changed: (value c3) from 26 to 32
   goals met: 1 of 3
22. (increment c3)
   changed: (value c3) from 32 to 38
   goals met: 1 of 3
23. (increment c3)
   changed: (value c3) from 38 to 44
   goals met: 1 of 3
24. (increment c3)
   changed: (value c3) from 44 to 50
   goals met: 2 of 3
25. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 2 of 3
26. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 2 of 3
27. (increment c1)
   changed: (value c1) from 41 to 47
   goals met: 1 of 3
28. (increment c2)
   changed: (value c2) from 45 to 48
   goals met: 2 of 3
29. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 2 of 3
30. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 2 of 3
31. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 2 of 3
32. (decrement c0)
   changed: (value c0) from 65 to 61
   goals met: 2 of 3
33. (decrement c0)
   changed: (value c0) from 61 to 57
   goals met: 2 of 3
34. (decrement c0)
   changed: (value c0) from 57 to 53
   goals met: 2 of 3
35. (decrement c0)
   changed: (value c0) from 53 to 49
   goals met: 2 of 3
36. (decrement c0)
   changed: (value c0) from 49 to 45
   goals met: 3 of 3
